## Pandas

### Series
1. Creating Pandas Series Object
2. Creating Pandas DataFrame Object
3. Indexing & Slicing both Objects

In [3]:
import pandas as pd

In [4]:
series=['rajiv','rohit']
series=pd.Series(series)

In [6]:
series.index

RangeIndex(start=0, stop=2, step=1)

In [8]:
series.values

array(['rajiv', 'rohit'], dtype=object)

In [ ]:
count={'India':100,'USA':50,'Russia':70}
count=pd.Series(count)

In [11]:
print(count.loc['India'])

100

In [12]:
print(count.iloc[1])

50

In [15]:
head={'India':'Pune','USA':'New York','Russia':'Moscow'}
head=pd.Series(head)
head

India         Pune
USA       New York
Russia      Moscow
dtype: object

### DataFrame

In [16]:
df=pd.DataFrame({'Head Office':head,'Emp Count':count})
df

       Head Office  Emp Count
India         Pune        100
USA       New York         50
Russia      Moscow         70

In [19]:
df1=pd.DataFrame([head,count])
df1

  India       USA  Russia
0  Pune  New York  Moscow
1   100        50      70

In [21]:
df.loc['India']

Head Office    Pune
Emp Count       100
Name: India, dtype: object

In [23]:
df.iloc[:2]

      Head Office  Emp Count
India        Pune        100
USA      New York         50

In [ ]:
df.iloc[1:3,[0,1]] # here [0,1] the cols are mentioned to display (indexed)

       Head Office  Emp Count
USA       New York         50
Russia      Moscow         70

In [ ]:
df.iloc[1:3,0:2] # here the cols are sliced

       Head Office  Emp Count
USA       New York         50
Russia      Moscow         70